КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НастройкиОрганизацийДиадок/КонтурЛогистика_НастройкиОрганизацийДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НастройкиОрганизацийДиадок</name>
  <enumValues>
    <name>LogisticsApiKey</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытий</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДатаПЛ</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийСервисаФизическихЛицДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоказанияГСМВЭПЛ</name>
    <comment>Проверка наличия показаний ГСМ на выезде и заезде в сервисе</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеОтправительПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеПолучательПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеТрН</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьВодителямВноситьПоказанияГСМ</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуДиадок</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуЛогистики</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадокДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадок</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НастройкиОрганизацийДиадок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЗначенияВыбораПоНастройке(Настройка) Экспорт
	
	Если Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеОтправительПутевогоЛиста
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеПолучательПутевогоЛиста
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ПодразделениеТрН Тогда
		
		Возврат Тип("СправочникСсылка.КонтурЛогистика_ПодразделенияДиадок");
		
	ИначеЕсли Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийПЛ 
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадок Тогда
		
		Возврат Тип("Строка");
		
	ИначеЕсли Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийСервисаФизическихЛицДата
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДиадокДата Тогда
		
		Возврат Тип("Дата");
		
	ИначеЕсли Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЗаполнятьПоказанияГСМВЭПЛ
		Или Настройка = Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.РазрешитьВодителямВноситьПоказанияГСМ Тогда
		
		Возврат Тип("Булево");
		
	Иначе
		
		ВызватьИсключение "Необходимо определить тип значения выбора в Перечислении.КонтурЛогистика_НастройкиОрганизацийДиадок";
		
	КонецЕсли;
	
КонецФункции

Функция ПараметрыРедактированияЗанчения(Настройка) Экспорт
	
	Параматры = Новый Структура;
	Параматры.Вставить("Комментарий", "");
	Параматры.Вставить("ПодсказкаВвода", "");
	
	Возврат Параматры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
